title: Unbalanced Quote Test
id: 1ee204b2-cfa8-44db-b2fe-85131897582d
status: experimental
description: Unbalanced quote test
references:
    - Internal Test
author: Swachchhanda Shrawan Poudel (Nextron Systems)
date: 2025-06-15
tags:
    - attack.execution
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image: 'C:\test
    condition: selection
falsepositives:
    - Unknown
level: high
